### 1. DataFrame - 컬럼명 변경 및 추가

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import matplotlib.pyplot as plt

In [2]:
data1 = {
        'name':['James','Peter','Robert','Tom'],
        'address':['NY','NY','LA','Texas'],
         'age':[33,44,55,66]
}
df1 = DataFrame(data1)
df1

     name address  age
0   James      NY   33
1   Peter      NY   44
2  Robert      LA   55
3     Tom   Texas   66

In [3]:
df2 = DataFrame(np.random.randint(10,100,16).reshape(4,4),
               index=list('ABCD'),
               columns=list('ABCD'))
df2.columns = ['one','two','three','four']
df2

   one  two  three  four
A   16   14     79    25
B   35   84     32    38
C   91   21     13    50
D   61   64     20    95

In [4]:
#1.  컬럼명 변경
'''
1) 전체 컬럼을 수정 - columns ---->  원본이 바뀐다.
2) 부분 컬럼을 수정 - rename(columns={})   ----> inplace = False
'''
df2.columns = ['A-class','B-class','C-class','D-class']
df2

   A-class  B-class  C-class  D-class
A       16       14       79       25
B       35       84       32       38
C       91       21       13       50
D       61       64       20       95

In [5]:
'''
inplace=False
의 의미는 원본이 바뀌지 않음을 의미한다.
원본을 바꿀려면 반드시 inplace=True로 지정해서 사용해야 한다...2

혹은
다른 변수에 새롭게 할당하고
새로운 변수를 출력해야 한다...1
'''
#1. 
# df1_1 = df1.rename(columns={'address':'addr'})
# df1_1

#2. 
df1.rename(columns={'address':'addr'}, inplace=True)
df1

     name   addr  age
0   James     NY   33
1   Peter     NY   44
2  Robert     LA   55
3     Tom  Texas   66

#### 2. DataFrame - 조회하기

In [6]:
df2

   A-class  B-class  C-class  D-class
A       16       14       79       25
B       35       84       32       38
C       91       21       13       50
D       61       64       20       95

In [7]:
#2. 컬럼 조회는 행을 조회하는 방법과는 다른 방법을 사용한다.
# df2[ 'one', 'three']# ?

df2[['one', 'three']]
# print(df2[df2['two']>45])

#  two컬럼에서 45보다 큰값들만 출력하세요... 숙제.....loc, iloc, at, iat를 사용
print(df2[df2[['two']]>45])
print('*'* 30)
print(df2[df2['two']>45])
print('#'* 30)
# print(df2[df2.iloc[:, 1:2]>45]['two'])
print(df2[df2['two'] > 45]['two'])

d = df2[df2.iloc[:, 1:2]>45]
d

KeyError: "None of [Index(['one', 'three'], dtype='object')] are in the [columns]"

In [ ]:
df2.columns = ['one','two','three','four']
df2

#1. 행을 검색하는 슬라이싱 방법( 1. 숫자 인덱스   2.라벨 인덱스)
df2[0:2] #인덱스..숫자...마지막 숫자는 포함 안함
df2['A':'B']#인덱스..라벨...마지막 라벨은 포함

df2['one':'three'] #슬라이싱...행을 조회하는 방법..행 부분에 저러누 라벨이 없기 때문에

In [ ]:
df1

### 3. iloc, loc   | iat, at 조회하기
--- 스칼라값 가져오는 용도가 아니다

In [ ]:
# iloc --- i는 index를 의미한다....그래서 마지막 숫자는 포함 안됨
print(df1.iloc[0:2, 0:3])
print('*'*30)
print(df1.iloc[:2, :3])
print('*'*30)
print(df1.iloc[0:2])
print('*'*30)
print(df1.iloc[:2])
print('*'*30)
print(df1.iloc[:2, :2])

In [ ]:
df1

In [ ]:
# loc를 살펴보자...
print(df1.loc[0:1])#라벨을 의미하기 때문에 마지막 숫자, 혹은 문자를 포함한다.
print(df1.loc[0:1,'name':'addr'])

In [ ]:
df1

In [ ]:
# 스칼라값 가져오기....iat, at
# Rober의 나이 55를 검색
print(df1.at[2,'age'])

#Tom의 주소를 검색...Texas...at
print(df1.at[3,'addr'])

# iat...Peter의 주소...NY를 검색
print(df1.iat[1,1])
# iat... Robert의 나이.. 55를 검색
print(df1.iat[2,2])

#### 4. 데이타 삭제하기---drop()

In [ ]:
# phone 컬럼 추가
df1['phone'] = np.nan
df1

df1.loc[4] = np.nan
df1

In [ ]:
# 데이타 삭제하기...drop() 함수
df1.drop(4) # 4행 라벨...삭제

In [ ]:
df1 # 원본 삭제 안된다...inplace옵션 줘야 한다...drop() 함수

In [ ]:
# drop 함수를 이용해서 phone컬럼을 삭제..inplace = True..원본 삭제

In [ ]:
df1.drop('phone',axis=1, inplace=True)

In [ ]:
df1.drop(4,inplace=True)

In [ ]:
df1

#### 5. 누락데이타 삭제하기 - dropna()

In [ ]:
'''
판다스 에서는 누락데이타를 모두 NaN으로 처리한다.
통계함수는 누락데이타를 배제하고 연산한다.
dropna()  - nan값이 하나라도 있는 모든 행을 삭제
dropna(how='all') - 모든 값이 NaN인 행만 삭제
dropna(how='any') - 하나라도 NaN이라면 그 행을 삭제...디폴트
dropna(thresh=3) - 몇개 이상의 값이 row에 있는지를 임계치로 확인
                   시계열 데이타에서 주로 사용한다.
                   특정한 시각에 생성되었거나 측정되어진 데이타
                   
------------------------------------------------------------
fillna() - NaN데이타를 다른 값으로 채우는 함수
-----------------------------------------------------------
isnull()
notnull()
'''

In [9]:
from numpy import nan as NA
df = DataFrame([[1, 6.5, 3], [1, NA, NA], [NA, NA, NA],[NA,6.5,3]])
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
removeNa=df.dropna() # how=any
removeNa

In [ ]:
df.dropna(how='all')

In [11]:
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
df.dropna(thresh=3)

     0    1    2
0  1.0  6.5  3.0

In [ ]:
df.fillna(0) #0으로 채운다.

In [ ]:
df.fillna(df.mean()) #평균값으로 채운다

In [ ]:
df.fillna(value=5)

In [ ]:
df.fillna(method='ffill')#이게 뭔가???

#### 6. DataFrame - 정렬하기 :: sort_index() | sort__values()

In [ ]:
df2

In [ ]:
df2.sort_index(axis=1, ascending=False)
df2.sort_values(by=['four'])

#### 실전데이타로 응용하기

In [ ]:
df3 = pd.read_csv('../data/tips.csv')
df3.head(3)

In [ ]:
# 문제 1. tip이라는 컬럼으로 정렬..내림차순정렬...샘플데이타 5개만 디스플레이
df3.sort_values(by=['tip'], ascending=False).head()

In [ ]:
#위의 정렬된 결과를 시각화 해서 ...
# df3.sort_values(by=['tip'], ascending=False).head().plot(kind='bar')
df3.sort_values(by=['tip'], ascending=False).head().plot(kind='barh')
plt.show()

In [ ]:
# 문제 2. day, tip컬럼을 차례로 정렬
# day는 내림차순 정렬, tip은 오름차순
# 마지막 데이타 7줄만 디스플레이 되도록

# plot() plt.show()...시각화
df3.sort_values(by=['day','tip'],ascending=[False, True]).tail(7)

In [ ]:
df3.sort_values(by=['day','tip'],ascending=[False, True]).tail(7).plot(kind='bar')
plt.show()

In [ ]:
# 문제 3.....DISTINCT...unique()
df3['day'].unique()

In [ ]:
df3['day'].value_counts()